Catalogs/LM_СтавкиПедагогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>LM_СтавкиПедагогов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаЗаЗанятие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаСЧеловека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаЗаЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСОплатыУченика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/LM_СтавкиПедагогов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОплатаЗаЗанятиеПриИзменении(Элемент)
	Объект.ОплатаЗаЧас			 = 0;
	Объект.ОплатаСЧеловека       = 0;
	Объект.ПроцентСОплатыУченика = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОплатаСЧеловекаПриИзменении(Элемент)
	Объект.ОплатаЗаЧас			 = 0;
	Объект.ОплатаЗаЗанятие       = 0;
	Объект.ПроцентСОплатыУченика = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОплатаЗаЧасПриИзменении(Элемент)
	Объект.ОплатаСЧеловека		 = 0;
	Объект.ОплатаЗаЗанятие       = 0;
	Объект.ПроцентСОплатыУченика = 0;
КонецПроцедуры

&НаКлиенте
Процедура ПроцентСОплатыУченикаПриИзменении(Элемент)
	Объект.ОплатаСЧеловека		 = 0;
	Объект.ОплатаЗаЗанятие       = 0;
	Объект.ОплатаЗаЧас			 = 0;
КонецПроцедуры
